<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/kedr-users/2011-December/index.html" >
   <LINK REL="made" HREF="mailto:kedr-users%40lists.berlios.de?Subject=Re%3A%20%5BKedr-users%5D%20%3D%3Futf-8%3Fb%3F0KDQsNC30L7QsdGA0LDQu9GB0Y8gOik%3D%3F%3D&In-Reply-To=%3C4ED7D2DA.3060703%40inbox.ru%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000001.html">
   <LINK REL="Next"  HREF="000003.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)</H1>
    <B>&#1045;&#1074;&#1075;&#1077;&#1085;&#1080;&#1081;</B> 
    <A HREF="mailto:kedr-users%40lists.berlios.de?Subject=Re%3A%20%5BKedr-users%5D%20%3D%3Futf-8%3Fb%3F0KDQsNC30L7QsdGA0LDQu9GB0Y8gOik%3D%3F%3D&In-Reply-To=%3C4ED7D2DA.3060703%40inbox.ru%3E"
       TITLE="[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)">eugene.spectre at inbox.ru
       </A><BR>
    <I>Thu Dec  1 20:17:46 CET 2011</I>
    <P><UL>
        <LI>Previous message: <A HREF="000001.html">[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)
</A></li>
        <LI>Next message: <A HREF="000003.html">[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&#1044;&#1086;&#1073;&#1088;&#1099;&#1081; &#1076;&#1077;&#1085;&#1100;, &#1048;&#1075;&#1086;&#1088;&#1100;!

On 01.12.2011 22:20, Igor Murzov wrote:
&gt;<i> kedr &#1079;&#1072;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;. &#1055;&#1088;&#1072;&#1074;&#1076;&#1072; &#1087;&#1088;&#1080; &#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1080; &#1103;&#1076;&#1088;&#1072; kedr_capture_trace &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075; &#1084;&#1085;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;. &#1053;&#1091; &#1076;&#1072; &#1083;&#1072;&#1076;&#1085;&#1086;. &#1041;&#1091;&#1076;&#1091; &#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; kgdb.
</I>&#1057;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1074;&#1077;&#1088;&#1085;&#1086;, &#1077;&#1089;&#1090;&#1100; &#1090;&#1072;&#1082;&#1072;&#1103; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;: &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; 
&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084;, &#1072; &#1090;&#1086; &#1080;&#1084;&#1103;, &#1087;&#1086;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1101;&#1090;&#1086;&#1090; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1074;&#1080;&#1076;&#1080;&#1090; (&#1074; &#1090;. &#1095;. &#1090;&#1086;, &#1095;&#1090;&#1086; 
lsmod &#1074;&#1099;&#1076;&#1072;&#1105;&#1090;).

&#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1089;&#1077;&#1082;&#1088;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1042;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; KEDR &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; 
ideapad_laptop? &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; LeakCheck, fault simulation, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1073;&#1086;&#1088; &#1090;&#1088;&#1072;&#1089;&#1089;&#1099; - 
&#1080;&#1083;&#1080; &#1074;&#1089;&#1105; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077;?

&#1053;&#1072;&#1089;&#1095;&#1105;&#1090; kedr_capture_trace - &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077;: &#1103; &#1090;&#1072;&#1082; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;, &#1086;&#1085; 
&#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; &#1090;&#1088;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1080; kernel oops &#1080;&#1083;&#1080; kernel panic? &#1048;&#1083;&#1080; &#1090;&#1088;&#1072;&#1089;&#1089;&#1072; 
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100;, &#1085;&#1086; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1042;&#1072;&#1096;&#1080;&#1093; &#1079;&#1072;&#1076;&#1072;&#1095; &#1090;&#1072;&#1084; &#1085;&#1077; &#1073;&#1099;&#1083;&#1086;?

&#1042;&#1072;&#1096;&#1080; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1084; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;. Bug reports &#1080; 
feature requests - &#1090;&#1086;&#1078;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090;. &#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1080; &#1087;&#1086;&#1078;&#1077;&#1083;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1089;&#1095;&#1105;&#1090; &#1090;&#1086;&#1075;&#1086;, 
&#1082;&#1072;&#1082;&#1080;&#1077; &#1090;&#1080;&#1087;&#1099; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1074; &#1103;&#1076;&#1088;&#1077; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1091;&#1084;&#1077;&#1090;&#1100; &#1086;&#1090;&#1083;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100;.

&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1042;&#1072;&#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1077;&#1090; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1089;&#1073;&#1086;&#1088; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1080; &#1082;&#1072;&#1082; 
&#1084;&#1086;&#1076;&#1091;&#1083;&#1100; &#1076;&#1077;&#1083;&#1072;&#1083;, &#1082;&#1072;&#1082;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080; &#1089; &#1082;&#1072;&#1082;&#1080;&#1084;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1083;, &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; 
&#1089;&#1084;&#1099;&#1089;&#1083; &#1074;&#1079;&#1075;&#1083;&#1103;&#1085;&#1091;&#1090;&#1100; &#1085;&#1072; SystemTap (<A HREF="http://sourceware.org/systemtap/">http://sourceware.org/systemtap/</A>). &#1052;&#1086;&#1097;&#1085;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;.

&#1045;&#1074;&#1075;&#1077;&#1085;&#1080;&#1081;



</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000001.html">[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)
</A></li>
	<LI>Next message: <A HREF="000003.html">[Kedr-users] &#1056;&#1072;&#1079;&#1086;&#1073;&#1088;&#1072;&#1083;&#1089;&#1103; :)
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#2">[ date ]</a>
              <a href="thread.html#2">[ thread ]</a>
              <a href="subject.html#2">[ subject ]</a>
              <a href="author.html#2">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/kedr-users">More information about the Kedr-users
mailing list</a><br>
</body></html>
